<ul class="list-group">
    <li class="list-group-item">
        Rickroll появился случайно в 2007 году на имиджборде 4chan. Пользователи делились ссылками на трейлер GTA IV, но
        один из них заменил оригинальную ссылку на клип Рика Эстли Never Gonna Give You Up. Остальные подхватили шутку:
        стали массово публиковать замаскированные ссылки на это видео. Обман быстро превратился в мем, а в 2008 году,
        после
        участия Эстли в параде Macy’s Thanksgiving, рикролл стал интернет-феноменом.
    </li>
</ul>